#include <iostream>
using namespace std;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — CHARACTER CREATION
Язык: C++
Формат: самостоятельная работа
Тема: Test Case и Checklist
============================================================

ОПИСАНИЕ

Программа создаёт игрового персонажа.

Пользователь вводит имя и уровень персонажа.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

1. Имя персонажа обязательно.

2. Имя должно содержать минимум 3 символа.

3. Уровень должен находиться от 1 до 50 включительно.

4. Персонаж с корректными данными должен быть создан.

5. При некорректном имени персонаж не должен создаваться.

6. При некорректном уровне персонаж не должен создаваться.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Создайте:

1. Не менее 6 Test Case.
2. Checklist для быстрой проверки создания персонажа.

Проверьте корректные и некорректные данные.

Для Test Case обязательно указывайте ожидаемый результат.

============================================================
*/

void createCharacter()
{
    string name;
    int level;

    cout << "\nВведите имя персонажа: ";
    cin >> name;

    cout << "Введите уровень: ";
    cin >> level;

    if (name.length() < 3)
    {
        cout << "Имя слишком короткое.\n";
        return;
    }

    if (level < 1 || level > 50)
    {
        cout << "Недопустимый уровень.\n";
        return;
    }

    cout << "Персонаж создан!\n";
}

int main()
{
    int choice;

    do
    {
        cout << "\n======= CHARACTER =======\n";
        cout << "1. Создать персонажа\n";
        cout << "0. Выход\n";

        cin >> choice;

        if (choice == 1)
        {
            createCharacter();
        }

    } while (choice != 0);

    return 0;
}
