#include <iostream>
using namespace std;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — ORDER CREATION
Язык: C++
Формат: самостоятельная работа
Тема: Test Case и Checklist
============================================================

ОПИСАНИЕ

Программа создаёт заказ в интернет-магазине.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

1. Количество товаров должно быть больше 0.

2. Общая стоимость заказа должна быть больше 0.

3. При корректных данных заказ создаётся.

4. При некорректных данных заказ не создаётся.

5. Количество товаров не может быть отрицательным.

6. Стоимость заказа не может быть отрицательной.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Создайте:

- Test Case для основных сценариев;
- Checklist для быстрой проверки заказа.

Проверьте положительные, нулевые и отрицательные значения.


============================================================
*/

void createOrder()
{
    int productCount;
    double total;

    cout << "\nКоличество товаров: ";
    cin >> productCount;

    cout << "Сумма заказа: ";
    cin >> total;

    if (productCount <= 0)
    {
        cout << "Количество товаров некорректно.\n";
        return;
    }

    if (total <= 0)
    {
        cout << "Сумма заказа некорректна.\n";
        return;
    }

    cout << "Заказ создан!\n";
}

int main()
{
    int choice;

    do
    {
        cout << "\n======= ONLINE SHOP =======\n";
        cout << "1. Создать заказ\n";
        cout << "0. Выход\n";

        cin >> choice;

        if (choice == 1)
        {
            createOrder();
        }

    } while (choice != 0);

    return 0;
}
