using System;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — SHOP DISCOUNT
Язык: C#
Формат: самостоятельная работа
Тема: Equivalence Partitioning + Decision Table
============================================================

ОПИСАНИЕ

Интернет-магазин предоставляет покупателю скидку.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

Скидка предоставляется, если выполняется хотя бы одно
из условий:

1. Покупатель имеет статус VIP.

ИЛИ

2. Сумма заказа не меньше 10000 рублей.

Если оба условия не выполнены, скидка не предоставляется.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Определите классы эквивалентности.

Затем составьте Decision Table.

Проверьте комбинации:

VIP + заказ меньше 10000
VIP + заказ 10000
VIP + заказ больше 10000
Не VIP + заказ меньше 10000
Не VIP + заказ 10000
Не VIP + заказ больше 10000

Для каждой комбинации укажите ожидаемый результат.

============================================================
*/

class Program
{
    static void CheckDiscount()
    {
        Console.Write("VIP клиент? 1/0: ");
        int vip = Convert.ToInt32(Console.ReadLine());

        Console.Write("Сумма заказа: ");
        double order = Convert.ToDouble(Console.ReadLine());

        if (vip == 1 || order >= 10000)
        {
            Console.WriteLine("Скидка 20%.");
        }
        else
        {
            Console.WriteLine("Скидка 5%.");
        }
    }

    static void Main()
    {
        int choice;

        do
        {
            Console.WriteLine("\n======= SHOP =======");
            Console.WriteLine("1. Проверить скидку");
            Console.WriteLine("0. Выход");

            Console.Write("Выберите действие: ");
            choice = Convert.ToInt32(Console.ReadLine());

            if (choice == 1)
            {
                CheckDiscount();
            }

        } while (choice != 0);
    }
}
