#include <iostream>
using namespace std;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — PLAYER HP
Язык: C++
Формат: самостоятельная работа
Тема: Positive / Negative Testing
============================================================

ОПИСАНИЕ

Программа изменяет количество здоровья игрового персонажа.

Максимальное здоровье — 100.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

1. Начальное здоровье персонажа — 100.

2. Урон должен быть положительным.

3. Лечение должно быть положительным.

4. Здоровье не может быть меньше 0.

5. Здоровье не может быть больше 100.

6. Некорректное значение урона не должно изменять здоровье.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Создайте Positive и Negative Test Case.

Проверьте:

- обычный урон;
- обычное лечение;
- урон 0;
- отрицательный урон;
- большой урон;
- лечение сверх максимального здоровья.

============================================================
*/

int health = 100;

void damage()
{
    int value;

    cout << "\nВведите урон: ";
    cin >> value;

    if (value <= 0)
    {
        cout << "Урон должен быть положительным.\n";
        return;
    }

    health -= value;

    if (health < 0)
    {
        health = 0;
    }

    cout << "Урон нанесен.\n";
}

void heal()
{
    int value;

    cout << "\nВведите лечение: ";
    cin >> value;

    if (value <= 0)
    {
        cout << "Лечение должно быть положительным.\n";
        return;
    }

    health += value;

    if (health > 100)
    {
        health = 100;
    }

    cout << "Персонаж вылечен.\n";
}

int main()
{
    int choice;

    do
    {
        cout << "\n========= PLAYER =========\n";
        cout << "1. Получить урон\n";
        cout << "2. Вылечиться\n";
        cout << "3. Показать здоровье\n";
        cout << "0. Выход\n";

        cin >> choice;

        switch (choice)
        {
            case 1:
                damage();
                break;

            case 2:
                heal();
                break;

            case 3:
                cout << "HP: " << health << "\n";
                break;
        }

    } while (choice != 0);

    return 0;
}
