#include <iostream>
using namespace std;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — CHARACTER LEVEL
Язык: C++
Формат: самостоятельная работа
Тема: Boundary Value Analysis
============================================================

ОПИСАНИЕ

Программа проверяет уровень игрового персонажа.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

1. Минимальный уровень — 1.

2. Максимальный уровень — 50.

3. Уровни от 1 до 50 включительно допустимы.

4. Уровни меньше 1 недопустимы.

5. Уровни больше 50 недопустимы.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Используйте Boundary Value Analysis.

Проверьте:

- значение ниже минимума;
- минимальное значение;
- значение сразу после минимума;
- значение внутри диапазона;
- значение сразу перед максимумом;
- максимальное значение;
- значение выше максимума.

Оформите результаты в Test Case.


============================================================
*/

void checkLevel()
{
    int level;

    cout << "Введите уровень: ";
    cin >> level;

    if (level >= 1 && level <= 50)
    {
        cout << "Уровень допустим.\n";
    }
    else
    {
        cout << "Недопустимый уровень.\n";
    }
}

int main()
{
    int choice;

    do
    {
        cout << "\n======= CHARACTER =======\n";
        cout << "1. Проверить уровень\n";
        cout << "0. Выход\n";

        cin >> choice;

        if (choice == 1)
        {
            checkLevel();
        }

    } while (choice != 0);

    return 0;
}
