using System;

/*
============================================================
ПРАКТИЧЕСКОЕ ЗАДАНИЕ — GAME AGE
Язык: C#
Формат: самостоятельная работа
Тема: Boundary Value Analysis
============================================================

ОПИСАНИЕ

Программа проверяет возраст игрока для доступа к игре.

------------------------------------------------------------
ТРЕБОВАНИЯ
------------------------------------------------------------

1. Минимальный возраст — 12 лет.

2. Максимальный возраст — 65 лет.

3. Значения от 12 до 65 включительно допустимы.

4. Значения меньше 12 недопустимы.

5. Значения больше 65 недопустимы.

------------------------------------------------------------
ЗАДАНИЕ ТЕСТИРОВЩИКА
------------------------------------------------------------

Проведите Boundary Value Analysis.

Проверьте:

11, 12, 13,
среднее значение,
64, 65, 66.

Для каждого значения определите ожидаемый результат.


============================================================
*/

class Program
{
    static void CheckAge()
    {
        Console.Write("Введите возраст: ");
        int age = Convert.ToInt32(Console.ReadLine());

        if (age >= 12 && age <= 65)
        {
            Console.WriteLine("Возраст подходит.");
        }
        else
        {
            Console.WriteLine("Возраст не подходит.");
        }
    }

    static void Main()
    {
        int choice;

        do
        {
            Console.WriteLine("\n========= GAME =========");
            Console.WriteLine("1. Проверить возраст");
            Console.WriteLine("0. Выход");

            Console.Write("Выберите действие: ");
            choice = Convert.ToInt32(Console.ReadLine());

            if (choice == 1)
            {
                CheckAge();
            }

        } while (choice != 0);
    }
}
